In [2]:
import datetime
current_time = datetime.datetime.now()
print("LAB 12 SHUBHANG GUPTA",str(current_time))

LAB 12 SHUBHANG GUPTA 2022-12-11 14:08:27.319209

In [3]:
import pandas as pd
import sqlite3
df1 = pd.read_excel('book.xlsx')

In [4]:
con = sqlite3.connect('db2.db')
df1.to_sql('students', con)

3

In [3]:
c=con.cursor()

In [4]:
c.execute('SELECT * FROM students')
print(c.fetchall())

[(0, 1, 'Radhe', 21), (1, 2, 'Raam', 23), (2, 3, 'Shyaan', 24)]

In [5]:
%load_ext sql

In [6]:
%sql sqlite:///db2.db

In [7]:
%%sql
SELECT *
from students

 * sqlite:///db2.db
Done.

[(0, 1, 'Radhe', 21), (1, 2, 'Raam', 23), (2, 3, 'Shyaan', 24)]

In [8]:
%%sql
SELECT count(*)
from students

 * sqlite:///db2.db
Done.

[(3,)]

In [9]:
%%sql
SELECT sum(AGE) as agesum
from students

 * sqlite:///db2.db
Done.

[(68,)]